### Ejercicios

1# Haz las importaciones necesarias para establecer la conexión y trabajar con Pandas. Establece la conexión usando mysql.connector utilizando try/except por si la conexión devuelve un error.

In [2]:
import mysql.connector
from mysql.connector import errorcode
import pandas as pd

In [ ]:
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='bbdd_alumnas')

except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)
else:
  cnx.close()

2# Crea un nuevo "schema" llamado "alumnas-promo-X"

In [5]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE DATABASE alumnas_promo_X")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

MySQLCursor: CREATE DATABASE alumnas_promo_X

3# Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [ ]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_X')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE TABLE Alumnas ( id_alumna INT, nombre VARCHAR(50), apellidos VARCHAR(50), ciudad VARCHAR(50), telefono VARCHAR(50))")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

MySQLCursor: CREATE TABLE Alumnas ( id_alumna INT, no..

4# Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [ ]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='alumnas_promo_X')


mycursor = cnx.cursor()
sql = "INSERT INTO Alumnas (id_alumna, nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s, %s)"
val = [
  (1, 'Ana', 'Garcia', 'Granada', '654789123'),
  (2, 'Rocio', 'Perez', 'Barcelona', '658932147'),
  (3, 'Juana', 'Thomas','Barcelona', '639852741'),
  (4,'Jazmin', 'Sanchez', 'Madrid', '963852741'),
  (5, 'Angelica', 'Chalco', 'Madrid', '925337948')
]

try: 
    mycursor.executemany(sql, val)
    cnx.commit()
    print(mycursor.rowcount, "registro/s insertado/s.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

5 registro/s insertado/s.

5# Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [11]:
# conectamos con el servidor
cnx = mysql.connector.connect(
  host="localhost",
  user="root",
  password="AlumnaAdalab",
  database="alumnas_promo_X"
)

# iniciamos el cursor
mycursor = cnx.cursor()

# realizamos la query
mycursor.execute("SELECT * FROM Alumnas")

# le pedimos que almacene todos los resultados
myresult = mycursor.fetchall()

# accedemos a cada fila de una en una usando un bucle for. Fijaos que nos devuelve tuplas!!!
for x in myresult:
  print(x)

(1, 'Ana', 'Garcia', 'Granada', '654789123')
(2, 'Rocio', 'Perez', 'Barcelona', '658932147')
(3, 'Juana', 'Thomas', 'Barcelona', '639852741')
(4, 'Jazmin', 'Sanchez', 'Madrid', '963852741')
(5, 'Angelica', 'Chalco', 'Madrid', '925337948')

In [ ]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='Alumnas_promo_X')

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT * FROM Alumnas")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])

#Cerramos la conexion
cnx.close()

df

   id_alumna    nombre apellidos     ciudad   telefono
0          1       Ana    Garcia    Granada  654789123
1          2     Rocio     Perez  Barcelona  658932147
2          3     Juana    Thomas  Barcelona  639852741
3          4    Jazmin   Sanchez     Madrid  963852741
4          5  Angelica    Chalco     Madrid  925337948

6# Muestra los 3 primeros y tres últimos registros del Dataframe.

In [13]:
df.head(3)

   id_alumna nombre apellidos     ciudad   telefono
0          1    Ana    Garcia    Granada  654789123
1          2  Rocio     Perez  Barcelona  658932147
2          3  Juana    Thomas  Barcelona  639852741

In [14]:
df.tail(3)

   id_alumna    nombre apellidos     ciudad   telefono
2          3     Juana    Thomas  Barcelona  639852741
3          4    Jazmin   Sanchez     Madrid  963852741
4          5  Angelica    Chalco     Madrid  925337948

7# Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [21]:
cnx = mysql.connector.connect(
              user='root', password='AlumnaAdalab',
              host='127.0.0.1',
              database='Alumnas_promo_X'
)


# iniciamos el cursor
mycursor = cnx.cursor()

# realizamos nuestra query
mycursor.execute("SELECT DISTINCT ciudad FROM Alumnas")

# le decimos a Python que nos devuelva todos los resultados de la query usando el método fetchall
myresult = mycursor.fetchall()
print(myresult)

[('Granada',), ('Barcelona',), ('Madrid',)]

In [41]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='Alumnas_promo_X')

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT DISTINCT ciudad FROM Alumnas")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ['ciudad'])

#Cerramos la conexion
cnx.close()

df

      ciudad
0    Granada
1  Barcelona
2     Madrid

8# Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [46]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='Alumnas_promo_X')

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT* FROM Alumnas WHERE ciudad = 'Madrid'")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])

#Cerramos la conexion
cnx.close()

df

   id_alumna    nombre apellidos  ciudad   telefono
0          4    Jazmin   Sanchez  Madrid  963852741
1          5  Angelica    Chalco  Madrid  925337948

In [47]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='Alumnas_promo_X')

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT* FROM Alumnas WHERE ciudad = 'Barcelona'")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])

#Cerramos la conexion
cnx.close()

df

   id_alumna nombre apellidos     ciudad   telefono
0          2  Rocio     Perez  Barcelona  658932147
1          3  Juana    Thomas  Barcelona  639852741